mslawicz/Zigbee_Msg_Clt/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/app_zigbee.c
  * @author  MCD Application Team
  * @brief   Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "tx_api.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/se/zcl.message.h"

/* USER CODE BEGIN Includes */
#include "zcl.basic.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U
#define CHANNEL                                     11

#define SW1_ENDPOINT                                2

/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

static void APP_ZIGBEE_ProcessNotifyM0ToM4(ULONG argument);
static void APP_ZIGBEE_ProcessRequestM0ToM4(ULONG argument);
static void APP_ZIGBEE_ProcessNwkForm(ULONG argument);

static void APP_ZIGBEE_TimingElapsed(void);

/* USER CODE BEGIN PFP */
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t   *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t   *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t   *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t    CptReceiveNotifyFromM0 = 0;
static __IO uint32_t    CptReceiveRequestFromM0 = 0;

static uint8_t  TimerID;

TX_THREAD       OsTaskNotifyM0ToM4Id;
TX_THREAD       OsTaskRequestM0ToM4Id;
TX_THREAD       OsTaskNwkFormId;
TX_MUTEX        MtxZigbeeId;

TX_SEMAPHORE    TransferToM0Semaphore;
TX_SEMAPHORE    StartupEndSemaphore;

TX_SEMAPHORE    NWKFormSemaphore;
TX_SEMAPHORE    NWKFormWaitSemaphore;
TX_SEMAPHORE    NotifyM0ToM4Semaphore;
TX_SEMAPHORE    RequestM0ToM4Semaphore;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info
{
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;
  bool init_after_join;

  struct ZbZclClusterT *messaging_client_1;
};
static struct zigbee_app_info zigbee_app_info;

/* Messaging client 1 custom callbacks */
static enum ZclStatusCodeT messaging_client_1_display_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageT *msg, struct ZbZclAddrInfoT *srcInfo);
static enum ZclStatusCodeT messaging_client_1_cancel_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageCancelT *cancel, struct ZbZclAddrInfoT *srcInfo);
static enum ZclStatusCodeT messaging_client_1_cancel_all_messages(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageCancelAllT *cancel_all, struct ZbZclAddrInfoT *srcInfo);
static enum ZclStatusCodeT messaging_client_1_display_protected_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageT *msg, struct ZbZclAddrInfoT *srcInfo);

static struct ZbZclMsgClientCallbacksT MsgClientCallbacks_1 =
{
  .display_message = messaging_client_1_display_message,
  .cancel_message = messaging_client_1_cancel_message,
  .cancel_all_messages = messaging_client_1_cancel_all_messages,
  .display_protected_message = messaging_client_1_display_protected_message,
};

/* USER CODE BEGIN PV */
uint8_t manufacturerName[] = "_Cinek2030";
uint8_t modelName[] = "_Message Display";
/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/* Messaging client display_message 1 command callback */
static enum ZclStatusCodeT messaging_client_1_display_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageT *msg, struct ZbZclAddrInfoT *srcInfo)
{
  /* USER CODE BEGIN 0 Messaging client 1 display_message 1 */
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 0 Messaging client 1 display_message 1 */
}

/* Messaging client cancel_message 1 command callback */
static enum ZclStatusCodeT messaging_client_1_cancel_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageCancelT *cancel, struct ZbZclAddrInfoT *srcInfo)
{
  /* USER CODE BEGIN 1 Messaging client 1 cancel_message 1 */
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 1 Messaging client 1 cancel_message 1 */
}

