mslawicz/Zigbee_Msg_Clt/STM32_WPAN/App/app_zigbee.c
/* Messaging client cancel_all_messages 1 command callback */
static enum ZclStatusCodeT messaging_client_1_cancel_all_messages(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageCancelAllT *cancel_all, struct ZbZclAddrInfoT *srcInfo)
{
  /* USER CODE BEGIN 2 Messaging client 1 cancel_all_messages 1 */
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 2 Messaging client 1 cancel_all_messages 1 */
}

/* Messaging client display_protected_message 1 command callback */
static enum ZclStatusCodeT messaging_client_1_display_protected_message(struct ZbZclClusterT *cluster, void *arg, struct ZbZclMsgMessageT *msg, struct ZbZclAddrInfoT *srcInfo)
{
  /* USER CODE BEGIN 3 Messaging client 1 display_protected_message 1 */
  return ZCL_STATUS_SUCCESS;
  /* USER CODE END 3 Messaging client 1 display_protected_message 1 */
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;
  UINT ThreadXStatus;
  CHAR * pTempBuf = TX_NULL;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* Initialize the mutex */
  tx_mutex_create(&MtxZigbeeId, "MtxZigbeeId", TX_NO_INHERIT);

  /* Initialize the semaphores */
  tx_semaphore_create(&StartupEndSemaphore, "StartupEndSemaphore", 0); /*< Create the semaphore and make it busy at initialization */
  tx_semaphore_create(&TransferToM0Semaphore, "TransferToM0Semaphore", 0);
  tx_semaphore_create(&NWKFormSemaphore, "NWKFormSemaphore", 0);
  tx_semaphore_create(&NWKFormWaitSemaphore, "NWKFormWaitSemaphore", 0);
  tx_semaphore_create(&NotifyM0ToM4Semaphore, "NotifyM0ToM4Semaphore", 0);
  tx_semaphore_create(&RequestM0ToM4Semaphore, "RequestM0ToM4Semaphore", 0);

  /* Create the Timer service */
  HW_TS_Create(CFG_TIM_PROC_ID_ISR, &TimerID, hw_ts_SingleShot, APP_ZIGBEE_TimingElapsed);

  /* Register task */
  /* Create the different tasks */
  tx_byte_allocate(pBytePool, (VOID**) &pTempBuf, THREADX_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskNotifyM0ToM4Id,
                                   "NotifyM0ToM4Id",
                                   APP_ZIGBEE_ProcessNotifyM0ToM4,
                                   0,
                                   pTempBuf,
                                   THREADX_STACK_SIZE_LARGE,
                                   NOTIFY_M0_TO_M4_PRIORITY,
                                   NOTIFY_M0_TO_M4_PRIORITY,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
  {
    APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED, 1);
  }

  tx_byte_allocate(pBytePool, (VOID**) &pTempBuf, THREADX_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskRequestM0ToM4Id,
                                   "RequestM0ToM4Id",
                                   APP_ZIGBEE_ProcessRequestM0ToM4,
                                   0,
                                   pTempBuf,
                                   THREADX_STACK_SIZE_LARGE,
                                   REQUEST_M0_TO_M4_PRIORITY,
                                   REQUEST_M0_TO_M4_PRIORITY,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
  {
    APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED, 1);
  }

  /* Task associated with network creation process */
  tx_byte_allocate(pBytePool, (VOID**) &pTempBuf, THREADX_STACK_SIZE_LARGE, TX_NO_WAIT);
  ThreadXStatus = tx_thread_create(&OsTaskNwkFormId,
                                   "NwkFormId",
                                   APP_ZIGBEE_ProcessNwkForm,
                                   0,
                                   pTempBuf,
                                   THREADX_STACK_SIZE_LARGE,
                                   NWL_FORM_PRIORITY,
                                   NWL_FORM_PRIORITY,
                                   TX_NO_TIME_SLICE,
                                   TX_AUTO_START);
  if (ThreadXStatus != TX_SUCCESS)
  {
    APP_ZIGBEE_Error(ERR_ZIGBEE_THREAD_X_FAILED, 1);
  }

  /* USER CODE BEGIN APP_ZIGBEE_INIT */
  /* USER CODE END APP_ZIGBEE_INIT */

  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();

}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_StackLayersInit(void)
{
  APP_DBG("APP_ZIGBEE_StackLayersInit");

  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
  manufacturerName[0] = strlen(manufacturerName) - 1;
  ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_BASIC_ATTR_MFR_NAME, manufacturerName, manufacturerName[0] + 1);
  modelName[0] = strlen(modelName) - 1;
  ZbZclBasicWriteDirect(zigbee_app_info.zb, SW1_ENDPOINT, ZCL_BASIC_ATTR_MODEL_NAME, modelName, modelName[0] + 1);
  /* USER CODE END APP_ZIGBEE_StackLayersInit */

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeJoin;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;

  /* run the task */
  tx_semaphore_put(&NWKFormSemaphore);
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* Endpoint: SW1_ENDPOINT */
  req.profileId = ZCL_PROFILE_SMART_ENERGY;
  req.deviceId = ZCL_DEVICE_IN_HOME_DISPLAY;
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);

  /* Messaging client */
  zigbee_app_info.messaging_client_1 = ZbZclMsgClientAlloc(zigbee_app_info.zb, SW1_ENDPOINT, &MsgClientCallbacks_1, NULL);
  assert(zigbee_app_info.messaging_client_1 != NULL);
  ZbZclClusterEndpointRegister(zigbee_app_info.messaging_client_1);

